---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectShapeType
source: html/53295e07-1849-ab5c-47e1-fedca7df1e76.htm
---
# DirectShapeType Members

Adds the externally tagged geometry object to the DirectShapeType.